#ifndef __LINEAR_CONVERTER_H_
#define __LINEAR_CONVERTER_H_
/*================================================================*/
/*
 Реализация кусочно-линейного преобразования, значения исходных величин
 должны быть отсортированы (ref_adc, ref_value)
 */
/*================================================================*/
#ifdef __cplusplus
extern "C" {
#endif
/*================================================================*/
float lc_convert_adc_to_value(const float *adc , float *ref_adc, float *ref_value, const int *num_ref_points);
/*================================================================*/
#ifdef __cplusplus
}
#endif
/*================================================================*/
#endif
