//Функции декодирования данных читаемых с порта
//данные с АЦП приходят в форме строки, в строке записано значение
//в шестнадцатиричной системе счисления и контрольная сумма,
//для проверки целостности пакета данных, значения начинается с символа !
//заканчивается символом @,

/**
  ******************************************************************************
  * @file    serial_frame3.h
  * @author  Милованов Александр
  * @version V3
  * @date    26 матра 2018
  * @brief   кодирование и декодирование блока двоичных данный в текстовую форму
  ******************************************************************************
  */
#ifndef __SERIAL_FRAME3_H_
#define __SERIAL_FRAME3_H_
/*======================================================================================*/
#include <stdint.h>
/*======================================================================================*/
/**
  * @brief  констаты блока
  */
//Формат данных: "!<text_data><crc16>@"
#define sf3_start_symbol '!'
#define sf3_end_symbol '@'
/*======================================================================================*/
//Вычсляет размер области памяти для сохраения пакета по известному размеру блока данных
#define sf3_calc_packet_size( data_size ) (  ((data_size)*2)+ 10 )
//Вычсляет примерный размер данных по известному размеру пакета
#define sf3_calc_data_size( packet_size ) (((packet_size)-6)/2)
/*======================================================================================*/
#ifdef __cplusplus
extern "C" {
#endif
/*======================================================================================*/
extern uint8_t sf3_error;
extern uint8_t sf3_encode_add_nl;
/*======================================================================================*/
/**
 * @brief декодирование из текста
 */
void sf3_decode( uint8_t * destination_data , uint8_t * source_string ,int source_string_size );

/**
 * @brief  декодирование пакета с проверкой маркеров, кода контроля и известного размера.
 * исходная строка может быть длинее чем требуется - всё что после маркера конца пакета отбрасывается
 * source_string_size - только ограничивает, область поиска маркера конца пакета
 */
void sf3_decode_packet( uint8_t * destination_data , uint8_t * source_string ,int source_string_size );

/*======================================================================================*/
#ifdef __cplusplus
}
#endif
/*======================================================================================*/
#endif
